tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "khanhas/tap"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Handy way to save and run project-specific commands
brew "just"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Platform built on V8 to build network applications
brew "node"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Library for command-line editing
brew "readline"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool Command Language
brew "tcl-tk"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Unpack everything with one command
brew "unp"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Command-line tool to customize Spotify client
brew "khanhas/tap/spicetify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logi-options+"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "AdBlock", id: 1402042596
mas "Copilot", id: 1447330651
mas "Goodnotes", id: 1444383602
mas "Parcel", id: 639968404
mas "Playlisty for Apple Music", id: 1459275972
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
